# NLS_MESSAGEFORMAT_ALL
# NLS_ENCODING=UNICODE
# HDFS Toolkit Error Messages Range CDIST1200 to CDIST1299 

# TRNOTE - Do not translate: JDBC, SQL, SPL
HDFS_NOT_CONSISTENT_REGION=CDIST1200E \u0423\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u0439 \u043d\u0438\u0436\u0435 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u043d\u0430\u0447\u0430\u043b\u043e\u043c \u043d\u0435\u043f\u0440\u0435\u0440\u044b\u0432\u043d\u043e\u0439 \u043e\u0431\u043b\u0430\u0441\u0442\u0438, \u0435\u0441\u043b\u0438 \u043f\u0440\u0438\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0432\u0445\u043e\u0434\u043d\u043e\u0439 \u043f\u043e\u0440\u0442: ''{0}''.

HDFS_ASYNC_UNABLE_WRITE_TO_STREAMS=CDIST1201E \u041d\u0435\u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e \u0437\u0430\u043f\u0438\u0441\u0430\u0442\u044c \u0432 \u0432\u044b\u0445\u043e\u0434\u043d\u043e\u0439 \u043f\u043e\u0442\u043e\u043a HDFS.
HDFS_ASYNC_UNABLE_ADD_TO_QUEUE=CDIST1202E \u041d\u0435 \u0443\u0434\u0430\u043b\u043e\u0441\u044c \u0434\u043e\u0431\u0430\u0432\u0438\u0442\u044c \u0431\u0443\u0444\u0435\u0440 \u043a \u043e\u0447\u0435\u0440\u0435\u0434\u0438 \u0431\u0443\u0444\u0435\u0440\u0430.
HDFS_ASYNC_INVALID_BUFFER_QUEUE=CDIST1203E \u041e\u0448\u0438\u0431\u043a\u0430 \u043f\u0440\u0438 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u0438 \u043e\u0447\u0435\u0440\u0435\u0434\u0438 \u0431\u0443\u0444\u0435\u0440\u0430.
HDFS_ASYNC_SERVICE_SHUTDOWN_INTERRUPTED=CDIST1204W \u0417\u0430\u0432\u0435\u0440\u0448\u0435\u043d\u0438\u0435 \u0440\u0430\u0431\u043e\u0442\u044b \u0441\u043b\u0443\u0436\u0431\u044b \u0432\u044b\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u044f \u043f\u0440\u0435\u0440\u0432\u0430\u043d\u043e.
HDFS_ASYNC_UNABLE_GET_BUFFER_QUEUE=CDIST1205E \u041d\u0435 \u0443\u0434\u0430\u043b\u043e\u0441\u044c \u043f\u043e\u043b\u0443\u0447\u0438\u0442\u044c \u0431\u0443\u0444\u0435\u0440 \u0438\u0437 \u043e\u0447\u0435\u0440\u0435\u0434\u0438 \u0431\u0443\u0444\u0435\u0440\u0430.

HDFS_DS_INVALID_INPUT_PORT=CDIST1206E \u041a\u043e\u043d\u0442\u0440\u043e\u043b\u044c\u043d\u044b\u0439 \u0432\u0445\u043e\u0434\u043d\u043e\u0439 \u043f\u043e\u0440\u0442 ''HDFSDirectoryScan'' \u043e\u0436\u0438\u0434\u0430\u0435\u0442 \u043e\u0434\u0438\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442. \u0422\u0438\u043f\u043e\u043c \u044d\u0442\u043e\u0433\u043e \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c ''rstring'' .
HDFS_DS_INVALID_ATTRIBUTE=CDIST1207E \u041e\u0436\u0438\u0434\u0430\u043b\u0441\u044f \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''rstring'', \u043d\u043e \u043d\u0430\u0439\u0434\u0435\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''{0}''. 
HDFS_DS_CONSISTENT_REGION_NOT_SUPPORTED=CDIST1208W \u0423\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0438\u0439 \u043f\u043e\u0440\u0442 \u0432 \u043d\u0435\u043f\u0440\u043e\u0442\u0438\u0432\u043e\u0440\u0435\u0447\u0438\u0432\u043e\u0439 \u043e\u0431\u043b\u0430\u0441\u0442\u0438 \u043d\u0435 \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044f. \u0423\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0430\u044f \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f \u043c\u043e\u0436\u0435\u0442 \u043d\u0435 \u0432\u043e\u0441\u043f\u0440\u043e\u0438\u0437\u0432\u043e\u0434\u0438\u0442\u044c\u0441\u044f, \u043d\u0435 \u0441\u043e\u0445\u0440\u0430\u043d\u044f\u0442\u044c\u0441\u044f \u0438 \u043d\u0435 \u0432\u043e\u0441\u0441\u0442\u0430\u043d\u0430\u0432\u043b\u0438\u0432\u0430\u0442\u044c\u0441\u044f \u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u044b\u043c \u043e\u0431\u0440\u0430\u0437\u043e\u043c. \u0412\u043e\u0437\u043c\u043e\u0436\u043d\u043e, \u0432\u0430\u043c \u043f\u0440\u0438\u0434\u0435\u0442\u0441\u044f \u0432\u0440\u0443\u0447\u043d\u0443\u044e \u0432\u043e\u0441\u043f\u0440\u043e\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0443\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0438\u0435 \u0441\u0438\u0433\u043d\u0430\u043b\u044b, \u0447\u0442\u043e\u0431\u044b \u0432\u0435\u0440\u043d\u0443\u0442\u044c \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 \u0432 \u043d\u0435\u043f\u0440\u043e\u0442\u0438\u0432\u043e\u0440\u0435\u0447\u0438\u0432\u043e\u0435 \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u0435."
HDFS_DS_INVALID_OUTPUT_PORT=CDIST1209E \u0412\u044b\u0445\u043e\u0434\u043d\u043e\u0439 \u043f\u043e\u0440\u0442 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430 HDFSDirectoryScan \u043e\u0436\u0438\u0434\u0430\u0435\u0442 \u043e\u0434\u0438\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442. \u0422\u0438\u043f\u043e\u043c \u044d\u0442\u043e\u0433\u043e \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c ''rstring'' .
HDFS_DS_INVALID_DIRECTORY_PARAM=CDIST1210E \u0415\u0441\u043b\u0438 \u0443 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430 \u043d\u0435\u0442 \u043d\u0438\u043a\u0430\u043a\u0438\u0445 \u0432\u0445\u043e\u0434\u043d\u044b\u0445 \u043f\u043e\u0440\u0442\u043e\u0432, \u043d\u0443\u0436\u043d\u043e \u0437\u0430\u0434\u0430\u0442\u044c \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u0430 (directory).
HDFS_DS_INVALID_SLEEP_TIMER_PARAM=CDIST1211E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 sleepTime \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430 \u043d\u0435 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u043c\u0435\u043d\u044c\u0448\u0435 0.
HDFS_DS_INVALID_INIT_DELAY_PARAM=CDIST1212E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 initDelay \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430 \u043d\u0435 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u043c\u0435\u043d\u044c\u0448\u0435 0.
HDFS_DS_INVALID_PATTERN_PARAM=CDIST1213E - \u044d\u0442\u043e \u043d\u0435\u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u044b\u0439 \u0448\u0430\u0431\u043b\u043e\u043d.
HDFS_DS_INVALID_URL_PARAM=CDIST1214E \u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 ''{0}'' \u0441\u043e\u0434\u0435\u0440\u0436\u0438\u0442 \u043d\u0435\u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u044b\u0439 URI: ''{1}''.
HDFS_DS_INVALID_DIRECTORY_SCHEMA=CDIST1215E \u0421\u0445\u0435\u043c\u0430 ''directory'' ''{0}'' \u0434\u043e\u043b\u0436\u043d\u0430 \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u043e\u0432\u0430\u0442\u044c \u0441\u0445\u0435\u043c\u0435 ''hdfsUri'' ''{1}''.
HDFS_DS_INVALID_HOST_DIRECTORY_SCHEMA=CDIST1216E \u0425\u043e\u0441\u0442 \u0438 \u043f\u043e\u0440\u0442, \u0437\u0430\u0434\u0430\u043d\u043d\u044b\u0435 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u043c ''directory'' ''{0}'', \u0434\u043e\u043b\u0436\u043d\u044b \u0441\u043e\u0432\u043f\u0430\u0434\u0430\u0442\u044c \u0441 \u0445\u043e\u0441\u0442\u043e\u043c \u0438 \u043f\u043e\u0440\u0442\u043e\u043c, \u0437\u0430\u0434\u0430\u043d\u043d\u044b\u043c\u0438 \u0441 \u043f\u043e\u043c\u043e\u0449\u044c\u044e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 ''hdfsUri'' ''{1}''.
HDFS_DS_NOT_SPECIFIED_DIRECTORY_PARAM=CDIST1217E \u0415\u0441\u043b\u0438 \u043d\u0435 \u043f\u0440\u0438\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0443\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0438\u0439 \u0432\u0445\u043e\u0434\u043d\u043e\u0439 \u043f\u043e\u0440\u0442, \u043d\u0443\u0436\u043d\u043e \u0437\u0430\u0434\u0430\u0442\u044c \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 directory.
HDFS_DS_NOT_SPECIFIED_DIR_PARAM=CDIST1218E \u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u0430 \u043d\u0435 \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0435\u043d. \u0421\u043a\u0430\u043d\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435 \u043e\u0441\u043d\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u0432\u0445\u043e\u0434\u043d\u044b\u0445 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f\u0445 \u043e\u0442 \u0443\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0435\u0433\u043e \u043f\u043e\u0440\u0442\u0430.
HDFS_DS_EMPTY_DIRECTORY_STRICT_MODE=CDIST1219E \u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 strictMode \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d \u0432 true, \u043d\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u0430 \u043f\u0443\u0441\u0442.
HDFS_DS_DIRECTORY_NOT_EXIST_STRICT_MODE=CDIST1220E \u0414\u043b\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 'strictMode' \u0437\u0430\u0434\u0430\u043d\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 true, \u043d\u043e \u043a\u0430\u0442\u0430\u043b\u043e\u0433 ''{0}'' \u043d\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442.
HDFS_DS_IS_NOT_A_DIRECTORY=CDIST1221E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 ''directory'', ''{0}'', \u043d\u0435 \u0441\u0441\u044b\u043b\u0430\u0435\u0442\u0441\u044f \u043d\u0430 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043b\u044c\u043d\u044b\u0439 \u043a\u0430\u0442\u0430\u043b\u043e\u0433.
HDFS_DS_EMPTY_DIRECTORY_PARAM=CDIST1222E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u0430 \u043f\u0443\u0441\u0442\u043e.
HDFS_DS_EMPTY_DIRECTORY_NOT_CONTROL_PORT=CDIST1223E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 directory - \u043f\u0443\u0441\u0442\u043e\u0435, \u0430 \u0443\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0438\u0439 \u0432\u0445\u043e\u0434\u043d\u043e\u0439 \u043f\u043e\u0440\u0442 \u043d\u0435 \u0437\u0430\u0434\u0430\u043d.
HDFS_DS_DIRECTORY_NOT_EXIST=CDIST1224E \u041a\u0430\u0442\u0430\u043b\u043e\u0433, \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u0439 ''{0}'', \u043d\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442.
HDFS_DS_DIRECTORY_NOT_EXIST_INPUT_PORT=CDIST1225E \u041a\u0430\u0442\u0430\u043b\u043e\u0433, \u0437\u0430\u0434\u0430\u043d\u043d\u044b\u0439 \u043e\u0442 \u0443\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0435\u0433\u043e \u0432\u0445\u043e\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0440\u0442\u0430 ''{0}'', \u043d\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442. 
HDFS_DS_INVALID_DIRECTORY_INPUT_PORT=CDIST1226E \u041a\u0430\u0442\u0430\u043b\u043e\u0433, \u0437\u0430\u0434\u0430\u043d\u043d\u044b\u0439 \u043e\u0442 \u0443\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0435\u0433\u043e \u0432\u0445\u043e\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0440\u0442\u0430 ''{0}'', \u043d\u0435 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043b\u044c\u043d\u044b\u043c \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u043e\u043c.
HDFS_DS_EMPTY_DIRECTORY_INPUT_PORT=CDIST1227E \u041a\u0430\u0442\u0430\u043b\u043e\u0433, \u043f\u043e\u043b\u0443\u0447\u0435\u043d\u043d\u044b\u0439 \u043e\u0442 \u0432\u0445\u043e\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0440\u0442\u0430, \u043f\u0443\u0441\u0442.
HDFS_DS_PUNCTUATION_FAILED=CDIST1228E \u041e\u0448\u0438\u0431\u043a\u0430 \u043f\u0440\u0438 \u043e\u0442\u043f\u0440\u0430\u0432\u043a\u0435 \u043a\u043e\u043d\u0435\u0447\u043d\u043e\u0433\u043e \u043f\u0440\u0435\u0440\u044b\u0432\u0430\u043d\u0438\u044f ''{0}''.
HDFS_DS_SUBMITTING_FAILED=CDIST1229E \u041e\u0448\u0438\u0431\u043a\u0430 \u043f\u0440\u0438 \u043f\u0435\u0440\u0435\u0434\u0430\u0447\u0435 \u043a\u043e\u0440\u0442\u0435\u0436\u0430 ''{0}''.

HDFS_SINK_OUTPUT_PORT=CDIST1230E \u0423 \u043d\u0435\u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u0433\u043e \u0432\u044b\u0445\u043e\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0440\u0442\u0430 \u0434\u043e\u043b\u0436\u043d\u044b \u0431\u044b\u0442\u044c \u0434\u0432\u0430 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430: ''rstring'' \u0434\u043b\u044f \u0438\u043c\u0435\u043d\u0438 \u0444\u0430\u0439\u043b\u0430 \u0438 'uint64' \u0434\u043b\u044f \u0440\u0430\u0437\u043c\u0435\u0440\u0430 \u0444\u0430\u0439\u043b\u0430.
HDFS_SINK_FIRST_OUTPUT_PORT=CDIST1231E \u041f\u0435\u0440\u0432\u044b\u0439 \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u043d\u0430 \u043d\u0435\u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u043c \u0432\u044b\u0445\u043e\u0434\u043d\u043e\u043c \u043f\u043e\u0440\u0442\u0443 \u0434\u043e\u043b\u0436\u0435\u043d \u0431\u044b\u0442\u044c ''rstring'' .
HDFS_SINK_SECOND_OUTPUT_PORT=CDIST1232E \u0412\u0442\u043e\u0440\u043e\u0439 \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u043d\u0430 \u043d\u0435\u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u043c \u0432\u044b\u0445\u043e\u0434\u043d\u043e\u043c \u043f\u043e\u0440\u0442\u0443 \u0434\u043e\u043b\u0436\u0435\u043d \u0431\u044b\u0442\u044c 'uint64'.
HDFS_SINK_ONE_ATTR_INPUT_PORT=CDIST1233E \u0423 \u0432\u0445\u043e\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0442\u043e\u043a\u0430 \u0434\u043e\u043b\u0436\u0435\u043d \u0431\u044b\u0442\u044c \u043e\u0434\u0438\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442, \u0435\u0441\u043b\u0438 \u043d\u0435 \u0437\u0430\u0434\u0430\u043d \u044d\u043b\u0435\u043c\u0435\u043d\u0442 ''{0}''.
HDFS_SINK_TWO_ATTR_INPUT_PORT=CDIST1234E \u0423 \u0432\u0445\u043e\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0442\u043e\u043a\u0430 \u0434\u043e\u043b\u0436\u0435\u043d \u0431\u044b\u0442\u044c \u043e\u0434\u0438\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442, \u0435\u0441\u043b\u0438 ''{0}'', \u0438 \u0434\u0432\u0430 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430, \u0435\u0441\u043b\u0438 \u0434\u043b\u044f ''{1}'' \u0437\u0430\u0434\u0430\u043d\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 'true'.
HDFS_SINK_INVALID_ATTR_TYPE=CDIST1235E \u041e\u0436\u0438\u0434\u0430\u043b\u0441\u044f \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''blob'', ''rstring'' \u0438\u043b\u0438 ''ustring'' \u043d\u0430 \u0432\u0445\u043e\u0434\u043d\u043e\u043c \u043f\u043e\u0440\u0442\u0443; \u043d\u0430\u0439\u0434\u0435\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''{1}''. 
HDFS_SINK_INVALID_ATTR_FILENAME_DATA=CDIST1236E \u0410\u0442\u0440\u0438\u0431\u0443\u0442 \u0438\u043c\u0435\u043d\u0438 \u0444\u0430\u0439\u043b\u0430 \u0434\u043e\u043b\u0436\u0435\u043d \u043e\u0442\u043d\u043e\u0441\u0438\u0442\u044c\u0441\u044f \u043a \u0442\u0438\u043f\u0443 ''ustring'' \u0438\u043b\u0438 ''rstring'' . \u0410\u0442\u0440\u0438\u0431\u0443\u0442 \u0434\u0430\u043d\u043d\u044b\u0445 \u0434\u043e\u043b\u0436\u0435\u043d \u043e\u0442\u043d\u043e\u0441\u0438\u0442\u044c\u0441\u044f \u043a \u0442\u0438\u043f\u0443 ''blob'', ''ustring'' \u0438\u043b\u0438 ''rstring'' .
HDFS_SINK_INVALID_PARAM_TEMPFILE=CDIST1237E \u0423\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u0439 \u043d\u0438\u0436\u0435 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u044c \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 'tempFile', \u0435\u0441\u043b\u0438 \u043e\u043d \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0447\u043b\u0435\u043d\u043e\u043c \u043d\u0435\u043f\u0440\u0435\u0440\u044b\u0432\u043d\u043e\u0439 \u043e\u0431\u043b\u0430\u0441\u0442\u0438: ''{0}''.
HDFS_SINK_INVALID_VALUE_BYTEPERFILE=CDIST1238E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 'bytesPerFile' \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430 \u043d\u0435 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u043c\u0435\u043d\u044c\u0448\u0435 0.
HDFS_SINK_INVALID_VALUE_TUPLESPERFILE=CDIST1239E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 'tuplesPerFile' \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430 \u043d\u0435 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u043c\u0435\u043d\u044c\u0448\u0435 0.
HDFS_SINK_INVALID_VALUE_TIMEPERFIL=CDIST1240E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 'timePerFile' \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430 \u043d\u0435 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u043c\u0435\u043d\u044c\u0448\u0435 0.
HDFS_SINK_INVALID_DATA_ATTR_TYPE=CDIST1241E \u0410\u0442\u0440\u0438\u0431\u0443\u0442 \u0434\u0430\u043d\u043d\u044b\u0445 \u0434\u043e\u043b\u0436\u0435\u043d \u0438\u043c\u0435\u0442\u044c \u0442\u0438\u043f ''ustring'', ''rstring'' \u0438\u043b\u0438 ''blob'' . \u041d\u0430\u0439\u0434\u0435\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''{0}''. 
HDFS_SINK_INVALID_ATTR_FILENAME=CDIST1242E \u041e\u0436\u0438\u0434\u0430\u043b\u0441\u044f \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''rstring'' \u0438\u043b\u0438 ''ustring'' \u043d\u0430 \u0432\u0445\u043e\u0434\u043d\u043e\u043c \u043f\u043e\u0440\u0442\u0443; \u043d\u0430\u0439\u0434\u0435\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''{0}''.
HDFS_SINK_NO_ATTRIBUTE=CDIST1243E \u041d\u0435\u0442 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \u0432\u043e \u0432\u0445\u043e\u0434\u043d\u043e\u043c \u043f\u043e\u0442\u043e\u043a\u0435.
HDFS_SINK_INVALID_SCHEMA=CDIST1244E \u0421\u0445\u0435\u043c\u0430 'file' ''{0}'' \u0434\u043e\u043b\u0436\u043d\u0430 \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u043e\u0432\u0430\u0442\u044c \u0441\u0445\u0435\u043c\u0435 ''hdfsUri'' ''{1}''.
HDFS_SINK_INVALID_HOST=CDIST1245E \u0425\u043e\u0441\u0442 \u0438 \u043f\u043e\u0440\u0442, \u0437\u0430\u0434\u0430\u043d\u043d\u044b\u0435 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u043c 'file' ''{0}'', \u0434\u043e\u043b\u0436\u043d\u044b \u0441\u043e\u0432\u043f\u0430\u0434\u0430\u0442\u044c \u0441 \u0445\u043e\u0441\u0442\u043e\u043c \u0438 \u043f\u043e\u0440\u0442\u043e\u043c, \u0437\u0430\u0434\u0430\u043d\u043d\u044b\u043c\u0438 \u0441 \u043f\u043e\u043c\u043e\u0449\u044c\u044e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 ''hdfsUri'' ''{1}''.
HDFS_SINK_SET_RESTARTING=CDIST1246E \u0417\u0430\u0434\u0430\u0442\u044c \u0434\u043b\u044f \u043f\u0435\u0440\u0435\u0437\u0430\u043f\u0443\u0441\u043a\u0430 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 true.

HDFS_SOURCE_INVALID_URL=CDIST1247E \u041d\u0435\u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e \u0441\u043a\u043e\u043d\u0441\u0442\u0440\u0443\u0438\u0440\u043e\u0432\u0430\u0442\u044c URI: ''{0}''.
HDFS_SOURCE_INVALID_PARAM=CDIST1248E \u0414\u043b\u044f HDFSFileSource \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044f, \u0447\u0442\u043e\u0431\u044b \u0431\u044b\u043b \u0443\u043a\u0430\u0437\u0430\u043d \u043b\u0438\u0431\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 \u0444\u0430\u0439\u043b\u0430, \u043b\u0438\u0431\u043e \u0447\u0438\u0441\u043b\u043e \u0432\u0445\u043e\u0434\u043d\u044b\u0445 \u043f\u043e\u0440\u0442\u043e\u0432, \u0440\u0430\u0432\u043d\u043e\u0435 \u0435\u0434\u0438\u043d\u0438\u0446\u0435.
HDFS_SOURCE_ONLY_ONE_PARAM=CDIST1249E \u0414\u043b\u044f HDFSFileSource \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044f, \u0447\u0442\u043e\u0431\u044b \u0431\u044b\u043b \u0443\u043a\u0430\u0437\u0430\u043d \u043b\u0438\u0431\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 \u0444\u0430\u0439\u043b\u0430, \u043b\u0438\u0431\u043e \u0447\u0438\u0441\u043b\u043e \u0432\u0445\u043e\u0434\u043d\u044b\u0445 \u043f\u043e\u0440\u0442\u043e\u0432, \u0440\u0430\u0432\u043d\u043e\u0435 \u0435\u0434\u0438\u043d\u0438\u0446\u0435. \u0423\u043a\u0430\u0437\u0430\u0442\u044c \u0438 \u0442\u043e, \u0438 \u0434\u0440\u0443\u0433\u043e\u0435 \u043e\u0434\u043d\u043e\u0432\u0440\u0435\u043c\u0435\u043d\u043d\u043e \u043d\u0435\u043b\u044c\u0437\u044f.
HDFS_SOURCE_INVALID_OUTPUT=CDIST1250E \u0423 \u0432\u044b\u0445\u043e\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0440\u0442\u0430 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u0442\u043e\u043b\u044c\u043a\u043e \u043e\u0434\u0438\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442. \u0422\u0438\u043f \u044d\u0442\u043e\u0433\u043e \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \u0434\u043e\u043b\u0436\u0435\u043d \u0431\u044b\u0442\u044c ''rstring'', ''ustring'' \u0438\u043b\u0438 ''blob'' .
HDFS_SOURCE_INVALID_ATTR_TYPE=CDIST1251E \u041e\u0436\u0438\u0434\u0430\u043b\u0441\u044f \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''rstring'', ''rstring'', ''ustring'' \u0438\u043b\u0438 ''blob'' ; \u043d\u0430\u0439\u0434\u0435\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''{0}''.
HDFS_SOURCE_INVALID_BLOCKSIZE_PARAM=CDIST1252E ''{0}'' \u043c\u043e\u0436\u0435\u0442 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u044c\u0441\u044f, \u0442\u043e\u043b\u044c\u043a\u043e \u0435\u0441\u043b\u0438 'outstream' \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043e\u043c \u0442\u0438\u043f\u0430 ''blob'' .
HDFS_SOURCE_INVALID_FILENAME_ATTR=CDIST1253E \u041e\u0436\u0438\u0434\u0430\u043b\u0441\u044f \u0442\u043e\u043b\u044c\u043a\u043e \u043e\u0434\u0438\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u043d\u0430 \u0432\u0445\u043e\u0434\u043d\u043e\u043c \u043f\u043e\u0440\u0442\u0443. \u0410\u0442\u0440\u0438\u0431\u0443\u0442 \u0434\u043e\u043b\u0436\u0435\u043d \u043e\u0442\u043d\u043e\u0441\u0438\u0442\u044c\u0441\u044f \u043a \u0442\u0438\u043f\u0443 ''rstring'', \u043f\u0440\u0435\u0434\u043e\u0441\u0442\u0430\u0432\u043b\u044f\u044f \u0438\u043c\u044f \u0444\u0430\u0439\u043b\u0430, \u043a\u043e\u0442\u043e\u0440\u044b\u0439 \u043d\u0443\u0436\u043d\u043e \u043e\u0442\u043a\u0440\u044b\u0442\u044c.
HDFS_SOURCE_INVALID_STRING_ATTR=CDIST1254E \u041e\u0436\u0438\u0434\u0430\u043b\u0441\u044f \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''rstring'', \u043d\u043e \u043d\u0430\u0439\u0434\u0435\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''{0}''.
HDFS_SOURCE_INVALID_HDFS_URL=CDIST1255E \u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 ''hdfsUri'' \u0441\u043e\u0434\u0435\u0440\u0436\u0438\u0442 \u043d\u0435\u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u044b\u0439 URI: ''{0}''. 
HDFS_SOURCE_INVALID_SCHEMA=CDIST1256E \u0421\u0445\u0435\u043c\u0430 'file' ''{0}'' \u0434\u043e\u043b\u0436\u043d\u0430 \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u043e\u0432\u0430\u0442\u044c \u0441\u0445\u0435\u043c\u0435 ''hdfsUri'' ''{1}''.
HDFS_SOURCE_INVALID_FILE_URL=CDIST1257E \u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 'file' \u0441\u043e\u0434\u0435\u0440\u0436\u0438\u0442 \u043d\u0435\u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u044b\u0439 URI: ''{0}''.
HDFS_SOURCE_INVALID_HOST=CDIST1258E \u0425\u043e\u0441\u0442 \u0438 \u043f\u043e\u0440\u0442, \u0437\u0430\u0434\u0430\u043d\u043d\u044b\u0435 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u043c 'file' ''{0}'', \u0434\u043e\u043b\u0436\u043d\u044b \u0441\u043e\u0432\u043f\u0430\u0434\u0430\u0442\u044c \u0441 \u0445\u043e\u0441\u0442\u043e\u043c \u0438 \u043f\u043e\u0440\u0442\u043e\u043c, \u0437\u0430\u0434\u0430\u043d\u043d\u044b\u043c\u0438 \u0441 \u043f\u043e\u043c\u043e\u0449\u044c\u044e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 ''hdfsUri'' ''{1}''.
HDFS_SOURCE_PROCESS_FILE=CDIST1259I \u0424\u0430\u0439\u043b \u043f\u0440\u043e\u0446\u0435\u0441\u0441\u0430: ''{0}''.
HDFS_SOURCE_NOT_OPENING_FILE=CDIST1260E \u041e\u0448\u0438\u0431\u043a\u0430 \u043f\u0440\u0438 \u043e\u0442\u043a\u0440\u044b\u0442\u0438\u0438 \u0444\u0430\u0439\u043b\u0430: ''{0}''.
HDFS_SOURCE_EXCEPTION_READ_FILE=CDIST1261E \u041f\u0440\u0438 \u0447\u0442\u0435\u043d\u0438\u0438 \u043f\u0440\u043e\u0438\u0437\u043e\u0448\u043b\u0430 \u0438\u0441\u043a\u043b\u044e\u0447\u0438\u0442\u0435\u043b\u044c\u043d\u0430\u044f \u0441\u0438\u0442\u0443\u0430\u0446\u0438\u044f: ''{0}''. 
HDFS_SOURCE_INIT_DELAY_INTERRUPTED=CDIST1262E \u0417\u0430\u0434\u0435\u0440\u0436\u043a\u0430 \u0438\u043d\u0438\u0446\u0438\u0430\u043b\u0438\u0437\u0438\u0430\u0446\u0438\u0438 \u043f\u0440\u0435\u0440\u0432\u0430\u043d\u0430.
HDFS_SOURCE_EMPTY_FILE_NAME=CDIST1263E \u0418\u043c\u044f \u0444\u0430\u0439\u043b\u0430 - \u043f\u0443\u0441\u0442\u0430\u044f \u0441\u0442\u0440\u043e\u043a\u0430. \u041f\u0440\u043e\u043f\u0443\u0441\u043a\u0430\u0435\u0442\u0441\u044f.
HDFS_SOURCE_INVALID_INIT_DELAY_PARAM=CDIST1264E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 initDelay \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430 \u043d\u0435 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u043c\u0435\u043d\u044c\u0448\u0435 0.

HDFS_CLIENT_AUTH_CONNECT=CDIST1265I \u0421\u043e\u0435\u0434\u0438\u043d\u0435\u043d\u0438\u0435 \u0441 HDFS: ''{0}''. 
HDFS_CLIENT_AUTH_ATTEMPTING_CONNECT=CDIST1266I \u041f\u043e\u043f\u044b\u0442\u043a\u0430 \u0441\u043e\u0435\u0434\u0438\u043d\u0438\u0442\u044c\u0441\u044f \u0441 URI: ''{0}''. 
HDFS_CLIENT_AUTH_PROXY_CONNECT=CDIST1267I \u0421\u043e\u0435\u0434\u0438\u043d\u0435\u043d\u0438\u0435 \u0432 \u043a\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u043f\u0440\u043e\u043a\u0441\u0438-\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u0435\u043b\u044f: ''{0}''. 
HDFS_CLIENT_AUTH_USING_KERBOSER=CDIST1268I \u0421\u043e\u0435\u0434\u0438\u043d\u0435\u043d\u0438\u0435 \u0441 \u043f\u043e\u043c\u043e\u0449\u044c\u044e kerberosPrincipal: ''{0}''. 
